
def f(nx,x1,x):
    #nx为待转换的x1进制数，x1为转换前进制，x为转换完进制，取值为2-128位
    a=[
    '0','1','2','3','4','5','6','7','8','9',
    'a','b','c','d','e','f','g','h','i','j','k',
    'l','m','n','o','p','q','r','s','t','u','v','w','x','y','z',
    'A','B','C','D','E','F','G','H','I','J','K',
    'L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z',
    'ⅰ','ⅱ','ⅲ','ⅳ','ⅴ','ⅵ','ⅶ','ⅷ','ⅸ','ⅹ',
    'Ⅰ','Ⅱ','Ⅲ','Ⅳ','Ⅴ','Ⅵ','Ⅶ','Ⅷ','Ⅸ','Ⅹ',
    '○','一','二','三','四','五','六','七','八','九',
    '零','壹','贰','叁','肆','伍','陆','柒','捌','玖',
    '甲','乙','丙','丁','戊','己','庚','辛','壬','癸',
    '子','丑','寅','卯','辰','巳','午','未','申','酉','戌','亥',
    '东','南','西','北'
    ]
    #可再扩展字符,如汉字'壹'，'甲乙丙丁'，'子丑寅卯'
    nx=str(nx)
    b1=list(nx)
    print (nx,"[",x1,"]==[",x,"] ",end='') 
    b2=[]
    for i in b1:
        for i1 in range(0,len(a)):
            if a[i1]==i:
                b2=b2+[i1]
                if i1>x1:
                    print (i,"错误定义")
    b2.reverse()
    #print(b2)
    n1=0
    n2=1
    for i in b2:
        n1=n1+int(i)*(pow(x1,n2-1))  #pow(x, n)，即计算 x 的 n 次幂函数
        n2=n2+1
        #print (n1,n2)
    n=n1
    #print(n)
    b=[]
    while True:
        s=n//x#商
        y=n%x#余数
        b=b+[y]
        if s==0:
            break
        n=s
    b.reverse()  #reverse() 函数用于反向列表中元素,由个，十百转为百十个
    bd=""
    for i in b:
        #print(a[i],end='')
        bd=bd+a[i]
    print (bd)
    return bd

chun='zF4mOFpN7A' 
print (chun)
print (f(chun[0:2],62,10)+f(chun[-8:-4],62,10)+f(chun[-4:],62,10))
#for i in range(0,128):
#	f(str(i),10,128)
f('12壹Ⅰⅲ东甲32',10,128)
#F(str,str的进制,需要转换的进制)
